In [1]:
import pandas as pd
a1=pd.read_csv("data.csv")

In [3]:
a1

  Name  Age  Salary
0  abc   12   10000
1  xyz   34   20000
2  pqr   24   23400
3  lmn   15    4100

In [4]:
a1.head(3)

  Name  Age  Salary
0  abc   12   10000
1  xyz   34   20000
2  pqr   24   23400

In [5]:
a1.tail(3)

  Name  Age  Salary
1  xyz   34   20000
2  pqr   24   23400
3  lmn   15    4100

In [6]:
a1["Age"]>30

0    False
1     True
2    False
3    False
Name: Age, dtype: bool

In [7]:
a1[a1["Age"]>30]

  Name  Age  Salary
1  xyz   34   20000

In [8]:
a1["Age"].max()

34

In [9]:
type(a1)

pandas.core.frame.DataFrame

In [10]:
a1.describe()

             Age       Salary
count   4.000000      4.00000
mean   21.250000  14375.00000
std     9.912114   8903.32335
min    12.000000   4100.00000
25%    14.250000   8525.00000
50%    19.500000  15000.00000
75%    26.500000  20850.00000
max    34.000000  23400.00000

In [11]:
a1.info

<bound method DataFrame.info of   Name  Age  Salary
0  abc   12   10000
1  xyz   34   20000
2  pqr   24   23400
3  lmn   15    4100>

In [12]:
a1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Salary  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [13]:
a1["Age"]

0    12
1    34
2    24
3    15
Name: Age, dtype: int64

In [14]:
a1[["Age","Salary"]]

   Age  Salary
0   12   10000
1   34   20000
2   24   23400
3   15    4100